app/controllers/archivos_controller.rb

SELECT "archivos".* FROM "archivos"
---
	def index
		@archivos = Archivo.all

SELECT  "archivos".* FROM "archivos" WHERE "archivos"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@archivo = Archivo.find(params[:id])

INSERT INTO "archivos" ("nombre", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "archivo2.txt"], ["fecha", "2015-11-27"], ["created_at", "2015-11-27 07:29:29.617952"], ["updated_at", "2015-11-27 07:29:29.617952"]]
---
	def create
		arch = params[:archivo][:nombre]
		ftp = Net::FTP.new
		ftp.connect("192.168.5.170",21)
		ftp.login("danielvm","daniel123")
		ftp.getbinaryfile(arch, '/home/danielvm/Documentos/ftp/'+arch, 1024)
		ftp.close
		@archivo = Archivo.new(nombre: params[:archivo][:nombre], fecha:Time.now)
		@archivo.save